IDEA Open Model
OpenModel.LineSegment3D Property
 List of LineSegment3D
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<LineSegment3D> LineSegment3D { get; set; }
Public Property LineSegment3D As List(Of LineSegment3D)
	Get
	Set
public:
property List<LineSegment3D^>^ LineSegment3D {
	List<LineSegment3D^>^ get ();
	void set (List<LineSegment3D^>^ value);
}
Property Value
Type: List<LineSegment3D>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace